
# Пояснение для первого уровня
tip_stage_one = """
Скобки выделены красным цветом.
            
Пример:
2(x + 8) это 2x + 16

Или рассмотрим другой пример
4 - 3(х + 4 - 2) это 4 - 3х - 12 + 6
Поясним этот пример
-3 умножить +x будет -3x потому что "-" на "+" дает "-"
-3 умножить +4 будет -12 потому что "-" на "+" дает "-"
-3 умножить -2 будет +6 потому что "-" на "-" дает "+"
"""


tip_stage_two = """
Элементы которые нужно переносить влево выделены синим, а вправо - красным

При переносе меняйте знак

Пример:
2x - 16 = x - 4 
после переноса получим:
2x - x = -4 + 16
"""

tip_stage_three = """
нужно заполнить
"""