
# Пояснение для первого уровня
tip_stage_one = """
Скобки выделены красным цветом.
            
Пример:
2(x + 8) это 2x + 16

Или рассмотрим другой пример
4 - 3(х + 4 - 2) это 4 - 3х - 12 + 6
Поясним этот пример
-3 умножить +x будет -3x потому что "-" на "+" дает "-"
-3 умножить +4 будет -12 потому что "-" на "+" дает "-"
-3 умножить -2 будет +6 потому что "-" на "-" дает "+"
"""

# Пояснение для второго уровня
tip_stage_two = """
Элементы которые нужно переносить влево выделены синим, а вправо - красным

При переносе меняйте знак

Пример:
2x - 16 = x - 4 
после переноса получим:
2x - x = -4 + 16
"""

# Пояснение для третьего уровня
tip_stage_three = """
Чтобы упростить уравнение нам нужно сложить неизвестные в левой части и числа в правой части учитывая знаки.

Например уравнение -2х + 4х = 8 - 6:
-2х + 4х это -2 + 4 = 2, значит в левой части 2х 
8 - 6 это 2

В результате после упрощения получаем:
2х = 2
"""

# Пояснение для четвертого уровня
tip_stage_four = """
Если в левой части осталось произведение неизвестного с числом, то нужно правую часть разделить на это число.
Например:
2x = 6 это x = 6 : 2 = 3
Значит ответ x = 3

Или:
-x = -2 это x = -2 : -1 = 2
Значит ответ x = 2

Если правая часть не делится нацело на левую, запишите в ответе дробь
Например:
2x = 3
Ответ:
x = 3/2
"""